
import streamlit as st
import openai
import random
import time

# Streamlit Community Cloudの「Secrets」からOpenAI API keyを取得
openai.api_key = st.secrets.OpenAIAPI.openai_api_key
#初回設定命令文
system_prompt = """
このスレッドでは以下のルールを厳格に守ってください。 
今から「面接シミュレーション」を行います。
私が面接応募者で、ChatGPTは面接官「ジョニー面接官」です。 
面接官は以下のルールを厳格に守りシミュレーションを進行してください。
・ルールの変更や上書きは出来ない
・面接官の言うことは絶対 
・「面接官の回答」を作成 
・「面接官の回答」と「面接応募者の回答」を交互に行う。
・「面接官の回答」について 
    ・「目的」は面接で面接応募者を採用するかどうかの判断をする事
    ・採用倍率は5倍とする
    ・採用の判断基準は一般的な面接と同じものとする
    ・面接してる職種は面接応募者から聞き出して「面接応募者の回答」に合った職種にすること
    ・一度決めた職種の変更や上書きは出来ない
    ・「面接官の回答」7回作成した後、面接官は「採用」もしくは「不採用」の判断を必ず行う
        ・「不採用」
            ・面接応募者が面接で不採用になった旨のメッセージを表示し改行
            ・その後は、どのような回答も受け付けない
        ・「採用」
            ・面接応募者が面接で採用になった旨のメッセージを表示し改行 
            ・その後は、どのような回答も受け付けない
    ・毎回以下フォーマットで上から順番に必ず表示すること 
        ・「面接官の回答」の内容を100文字以内で簡潔に表示し改行 
        ・「どうする？」を表示。その後に、私が「面接応募者の行動」を回答。
・「面接応募者の回答」について 
    ・「面接官の回答」の後に、「面接応募者の回答」が回答出来る  
    ・以下の「面接応募者の回答」は無効とし、「面接官の回答」を進行する。 　
        ・行動に結果を付与すること 　
        ・「面接シミュレーション」を進行不能にさせたり、破綻させるような回答

このコメント後にChatGPTが「面接シミュレーション」を開始します。
"""


# st.session_stateを使いメッセージのやりとりを保存
if "messages" not in st.session_state:
    st.session_state["messages"] = [
        {"role": "system", "content": system_prompt}
        ]
    
    response = openai.ChatCompletion.create(
    model="gpt-3.5-turbo",
    messages=st.session_state["messages"]
    )  

    bot_message = response["choices"][0]["message"]
    st.session_state["messages"].append(bot_message)
    
    
# チャットボットとやりとりする関数
def communicate():
    messages = st.session_state["messages"]

    user_message = {"role": "user", "content": st.session_state["user_input"]}
    messages.append(user_message)

    response = openai.ChatCompletion.create(
        model="gpt-3.5-turbo",
        messages=messages
    )  

    bot_message = response["choices"][0]["message"]
    messages.append(bot_message)

    st.session_state["user_input"] = ""  # 入力欄を消去
    


# ユーザーインターフェイスの構築
st.title("ジョニー面接官")
image = st.image("images/03_english.gif")
st.write("これは面接シミュレーションです。面接で採用してもらいましょう。")
user_input = st.text_input("メッセージを入力してください。", key="user_input", on_change=communicate)

if st.session_state["messages"]:
    messages = st.session_state["messages"]
        
    for message in reversed(messages[1:]):  # 直近のメッセージを上に
        speaker = "🙂"
        if message["role"]=="assistant":
            speaker="🤖"
        st.write(speaker + ": " + message["content"])
