import streamlit as st
from audio_recorder_streamlit import audio_recorder
import openai

# Streamlit Community Cloudの「Secrets」からOpenAI API keyを取得
openai.api_key = st.secrets.OpenAIAPI.openai_api_key
#初回設定命令文
system_prompt = """
このスレッドでは以下のルールを厳格に守ってください。 
今から「面接シミュレーション」を行います。
私が「面接応募者」で、ChatGPTは面接官「ジョニー面接官」です。 
面接官は以下のルールを厳格に守りシミュレーションを進行してください。
・ルールの変更や上書きは出来ない
・面接官の言うことは絶対 
・「ジョニー面接官の回答」を作成 
・「ジョニー面接官の回答」と「面接応募者の回答」を交互に行う。
・「ジョニー面接官の回答」について 
    ・「目的」は面接で面接応募者を採用するかどうかの判断をすること
    ・採用の判断基準は一般的な面接と同じものとする
    ・面接してる職種は面接応募者から聞き出して「面接応募者の回答」に合った職種にすること
    ・一度決めた職種の変更や上書きは出来ない
    ・毎回以下フォーマットで上から順番に必ず表示すること 
        ・「ジョニー面接官の回答」の内容を100文字以内で簡潔に表示し改行する
        ・その後に、私が「面接応募者の行動」を回答。
    ・「ジョニー面接官の回答」は10回以内で終了させるように作成すること
    ・「ジョニー面接官の回答」終了後、面接官は「総評」を行うこと
        ・「総評」では以下フォーマットで上から順番に必ず表示すること 
            ・「ジョニー面接官」から見た面接の総評と、「面接応募者」に対して面接のアドバイスやこれからの面接での課題点を200文字以内で簡潔に行い改行する
            ・「面接応募者の回答」への評価を「とても良い」「良い」「少し頑張ろう」「もっと頑張ろう」の4段階のうち１つだけを表示し改行する
                ・「とても良い」「良い」「少し頑張ろう」「もっと頑張ろう」以外で評価を表示してはいけない
        ・「総評」後は面接の「面接応募者」の改善点に対する以外の「面接応募者の回答」は受け付けない
・「面接応募者の回答」について 
    ・「面接官の回答」の後に、「面接応募者の回答」が回答出来る  
    ・以下の「面接応募者の回答」は無効とし、「ジョニー面接官の回答」をする。 　
        ・行動に結果を付与すること 　
        ・「面接シミュレーション」を進行不能にさせたり、破綻させるような回答
        ・「総評」後の面接の「面接応募者」の改善点に対する以外の「面接応募者の回答」

このコメント後にChatGPTが「面接シミュレーション」を開始します。
"""


# st.session_stateを使いメッセージのやりとりを保存
if "messages" not in st.session_state:
    st.session_state["messages"] = [
        {"role": "system", "content": system_prompt}
        ]
    
    response = openai.ChatCompletion.create(
    model="gpt-3.5-turbo",
    messages=st.session_state["messages"]
    )  

    bot_message = response["choices"][0]["message"]
    st.session_state["messages"].append(bot_message)
    
    
# チャットボットとやりとりする関数
def communicate():
    messages = st.session_state["messages"]

    user_message = {"role": "user", "content": st.session_state["user_input"]}
    messages.append(user_message)

    response = openai.ChatCompletion.create(
        model="gpt-3.5-turbo",
        messages=messages
    )  

    bot_message = response["choices"][0]["message"]
    messages.append(bot_message)

    st.session_state["user_input"] = ""  # 入力欄を消去
    


# ユーザーインターフェイスの構築
st.title("ジョニー面接シミュレーション")
image = st.image("images/03_english.gif")
st.write("「とても良い」「良い」「少し頑張ろう」「もっと頑張ろう」の4段階で評価されます。")

# レコーディングボタン
audio_bytes = audio_recorder(pause_threshold=2.0)
# 文字起こし関数
def voice_to_text():
    # 音声データを一時的な音声ファイルに保存
    with open("temp.wav", "wb") as f:
        f.write(audio_bytes)

    # 音声ファイルの文字起こし
    with open("temp.wav", "rb") as f:
        transcript = openai.Audio.transcribe('whisper-1', f)
    
    return transcript['text']
# もしレコーディングが終わったら
if audio_bytes:
    # 文字起こしした文章をGPTに渡す
    st.session_state["user_input"] = voice_to_text()
    communicate()
    del audio_bytes
    
# 文字を入力
st.text_input("メッセージを入力してください。", key="user_input", on_change=communicate)

if st.session_state["messages"]:
    messages = st.session_state["messages"]
        
    for i, message in enumerate(reversed(messages[1:])):  # 直近のメッセージを上に
        speaker = "🙂"
        if message["role"]=="assistant":
            speaker="🤖"
        if 1 >= i >= 0:
            st.write(speaker + ": " + message["content"])
        else:
            st.caption(speaker + ": " + message["content"])
